{
    "usd-stablecoins": [
        {
            "address": "0x15700b564ca08d9439c58ca5053166e8317aa138",
            "reason": "deUSD (Elixir) is a failed stablecoin project that announced termination in late 2025 following a collateral crisis; the asset is significantly de-pegged and no longer functions as a stablecoin.",
            "timestamp": "2026-01-28T19:32:15.814Z"
        },
        {
            "address": "0xe4b70f9ddbb286f3cfa836e0fd970479f3193252",
            "reason": "USDZ (USD ZeroGas) could not be verified as a legitimate or recognized stablecoin project; it has extremely low swap activity and lacks verifiable protocol documentation.",
            "timestamp": "2026-01-28T19:32:15.816Z"
        },
        {
            "address": "0xed7fd16423bc19b9143313ac5e4b7f731d714e97",
            "reason": "PepeUSD is a meme-based token rather than a legitimate stablecoin protocol with a verifiable pegging mechanism.",
            "timestamp": "2026-01-28T19:32:15.816Z"
        },
        {
            "address": "0xa3931d71877c0e7a3148cb7eb4463524fec27fbd",
            "reason": "I used Google Search to verify that sUSDS (Savings USDS) is the yield-bearing version of USDS from the Sky Protocol (formerly MakerDAO). While it is a legitimate project, its value increases over time relative to the USD peg as it accumulates yield (share-price model). It is excluded based on the criteria that price must not go up as compound interest.",
            "timestamp": "2026-01-28T19:37:40.750Z"
        },
        {
            "address": "0x5b6e3887b6420f5f39aa7db4f4738f0a9ca3f8f5",
            "reason": "Inero USD (USDI) is flagged as a high-risk project with low volume, unverified supply, and ranking penalties on major trackers. It is not a reputable USD stablecoin project.",
            "timestamp": "2026-01-28T19:37:40.752Z"
        },
        {
            "address": "0x5c5b196abe0d54485975d1ec29617d42d9198326",
            "reason": "I verified via Google Search that sdeUSD (Staked deUSD) is a yield-bearing synthetic dollar from the Elixir protocol. Similar to sUSDS, its price increases as it accumulates yield, which disqualifies it under the requirement to not be an USD token whose price goes up as compound interest.",
            "timestamp": "2026-01-28T19:37:40.752Z"
        },
        {
            "address": "0xb0a16535eb77c6d7f75e9fc201d468a40abda7a1",
            "reason": "Trillion USD (TNUSD) is a low-quality project with a very small holder base and insignificant market presence. It does not meet the standards for a legitimate, high-TVL stablecoin project.",
            "timestamp": "2026-01-28T19:37:40.752Z"
        },
        {
            "address": "0x35d8949372d46b7a3d5a56006ae77b215fc69bc0",
            "reason": "This is bUSD0 (Bond USD0) by Usual Money, which is a yield-bearing bond token that trades at a discount and appreciates toward par. It is not a standard $1-pegged stablecoin for this basket.",
            "timestamp": "2026-01-28T20:12:26.270Z"
        },
        {
            "address": "0x75af3fd37d7ca74447e865f792f263b2b1159b58",
            "reason": "This token is a malicious impersonator of Tether USD (USDT). It lacks high TVL, lacks recognition from official bridge protocols, and has negligible volume compared to legitimate bridged versions.",
            "timestamp": "2026-01-28T20:30:50.415Z"
        },
        {
            "address": "0x57f5e098cad7a3d1eed53991d4d66c45c9af7812",
            "reason": "Wrapped Mountain Protocol USD (wUSDM) is a yield-bearing wrapper where the yield is reflected in the unit price rather than via rebasing. Since its price increases over time (e.g., currently ~$1.09), it violates the criteria to not be an asset whose price goes up as compound interest.",
            "timestamp": "2026-01-28T20:35:33.002Z"
        },
        {
            "address": "0x4879ccc5496c76c13e93cc8a18aba9a7fa445543",
            "reason": "pre-iUSDT is a points or claimable future asset for the Hourglass protocol, not a USD-pegged stablecoin.",
            "timestamp": "2026-01-28T23:05:07.087Z"
        },
        {
            "address": "0x3d7d6fdf07ee548b939a80edbc9b2256d0cdc003",
            "reason": "srUSDe (Strata Senior USDe) is a yield-bearing senior tranche product, categorized as a structured yield instrument rather than a standard stablecoin.",
            "timestamp": "2026-01-28T23:05:07.087Z"
        },
        {
            "address": "0xc8cf6d7991f15525488b2a83df53468d682ba4b0",
            "reason": "sUSDf is a yield-bearing (staked) version of Falcon USD, designed to accumulate yield through trading strategies.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0x5c20b550819128074fd538edf79791733ccedd18",
            "reason": "fUSDT is a Fluid (Instadapp) yield-bearing asset where the exchange rate increases over time.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0xd1074e0ae85610ddba0147e29ebe0d8e5873a000",
            "reason": "Plasma USD Vault is a yield-bearing deposit receipt for the Plasma Finance platform, not a primary stablecoin.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0x00cd995ac218d1ef85db0eb84469a178e5814683",
            "reason": "This is a low-liquidity impersonator of Tether USD; the official USDT address on Ethereum is 0xdac17f958d2ee523a2206206994597c13d831ec7.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0x4737d9b4592b40d51e110b94c9c043c6654067ae",
            "reason": "slvlUSD is a staked (yield-bearing) version of Level USD, which accumulates value through interest.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0xd3fd63209fa2d55b07a0f6db36c2f43900be3094",
            "reason": "wsrUSD is a 'Savings' wrapper (Wrapped Savings rUSD), which is interest-bearing and not a flat stablecoin.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0x1e33e98af620f1d563fcd3cfd3c75ace841204ef",
            "reason": "DUSD (Dialectic USD) appears to be a specialized fund or internal asset with very low public utility and liquidity.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0x40052868b2bc56b90fe9823428c1291929551512",
            "reason": "This is a malicious scam token misspelled as 'Tethor USD' to deceive users.",
            "timestamp": "2026-01-28T23:05:07.088Z"
        },
        {
            "address": "0xc9b7893ff5ed7d24d68e386c877830738d3c9cd9",
            "reason": "This address is an impersonator of the official TrueUSD (TUSD) token on Ethereum. The official TUSD contract address is 0x0000000000085d4780B73119b644AE5ecd22b376. The candidate token has negligible TVL ($3.54K) and volume, which is inconsistent with the multi-million dollar liquidity of the genuine stablecoin on the Ethereum mainnet.",
            "timestamp": "2026-01-28T23:20:56.740Z"
        },
        {
            "address": "0x738d1115b90efa71ae468f1287fc864775e23a31",
            "reason": "Savings rUSD (srUSD) is a legitimate yield-bearing token from the Reservoir Protocol, but it does not meet the specific criteria for this basket. It is a share-based asset where the price per token increases over time relative to the rUSD stablecoin to reflect accrued interest (currently trading at approximately $1.12). The basket rules explicitly exclude USD tokens whose price goes up as compound interest, requiring assets to maintain a 1:1 peg.",
            "timestamp": "2026-01-28T23:42:10.234Z"
        },
        {
            "address": "0x6503de9fe77d256d9d823f2d335ce83ece9e153f",
            "reason": "This is a pre-deposit vault receipt for the Stable Network project. It is a claim on future tokens/assets and does not function as a liquid USD-pegged stablecoin, as evidenced by its highly volatile and de-pegged market price.",
            "timestamp": "2026-01-29T00:05:24.736Z"
        },
        {
            "address": "0xc58d044404d8b14e953c115e67823784dea53d8f",
            "reason": "This is the 'Junior' tranche of the Strata USDe yield protocol. It is a leveraged investment product designed to capture yield and absorb risk, meaning its price fluctuates based on performance and it is not intended to maintain a stable 1:1 USD peg.",
            "timestamp": "2026-01-29T00:05:24.736Z"
        },
        {
            "address": "0xaf1157149ff040dad186a0142a796d901bef1cf1",
            "reason": "USDi Coin is an inflation-linked token designed to track the Consumer Price Index (CPI) rather than a 1:1 USD peg. Its price increases over time to reflect inflation, violating the criteria for standard USD stablecoins and the restriction against tokens whose price increases.",
            "timestamp": "2026-01-29T00:13:44.573Z"
        },
        {
            "address": "0xc5d6a7b61d18afa11435a889557b068bb9f29930",
            "reason": "Savings USDD (sUSDD) is a yield-bearing version of the USDD stablecoin. Its price relative to USD increases over time as interest is accrued (currently trading around $1.04), which violates the specific basket criteria excluding USD tokens with price appreciation from compound interest.",
            "timestamp": "2026-01-29T00:13:44.573Z"
        },
        {
            "address": "0x17b65cfcd084739459ecc8fdc032e9cbc7aeefda",
            "reason": "This token is an unverified project using the symbol USDG (often associated with the regulated Global Dollar by Paxos). It is identified as 'USDGOLD' or associated with '@UsdMem' on social media, with unverified supply and low liquidity, suggesting it is an impersonator or a meme coin rather than a legitimate USD stablecoin.",
            "timestamp": "2026-01-29T01:12:32.687Z"
        }
    ],
    "eth-pegged-assets": [
        {
            "address": "0xf80fc1ce16cbcbd18421e9cd055ca1bb58a9e097",
            "reason": "Low holder count and negligible volume suggest this is not a legitimate liquid pegged token for a curated list.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0xfe0c30065b384f05761f15d0cc899d4f9f9cc0eb",
            "reason": "This is the governance token for ether.fi, not a price-pegged ETH asset.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0xaa6e8127831c9de45ae56bb1b0d4d4da6e5665bd",
            "reason": "This is a leveraged index token with 2x volatility; it is not pegged 1:1 to the price of ETH.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0x7e0db521828743a65e4ad1246fd0cc8e04c0866b",
            "reason": "Obscure token with insufficient verification as a legitimate pegged project.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0xa250cc729bb3323e7933022a67b52200fe354767",
            "reason": "Niche double-wrapped token with low liquidity; not a standard curated pegged asset.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0x2abd7bb192ffc644f95603f9b4832ceb8492d2dd",
            "reason": "Impersonator; the official WETH contract on Ethereum is 0xc02aaa...",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0x325a87aabeaa1097011f4838d9152ba44e7f282b",
            "reason": "Represents the Ethereum PoW fork (ETHW), which is a different asset not pegged to the main Ethereum price.",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0x32d222e1f6386b3df7065d639870be0ef76d3599",
            "reason": "Impersonator; the official WETH contract on Ethereum is 0xc02aaa...",
            "timestamp": "2026-01-29T00:12:57.048Z"
        },
        {
            "address": "0xa7d0647889de293ab5dd3a8718b3ea65651305a0",
            "reason": "The token name indicates a specific price strike/level (@ 3800), suggesting it is a structured product or option-like asset rather than a general ETH-pegged token.",
            "timestamp": "2026-01-29T00:27:02.967Z"
        },
        {
            "address": "0x0c582b44fffddc1c5dd65e43867fe200d2e63e46",
            "reason": "The token name indicates a specific price strike/level (@ 10000), suggesting it is a structured product rather than a general ETH-pegged token.",
            "timestamp": "2026-01-29T00:27:02.968Z"
        },
        {
            "address": "0x9b2c171abb9c732ffa3789724d0aa653c9e0c428",
            "reason": "KGETH is a niche regional wrapper ('Kyrgyz Som Wrapped') which may introduce foreign exchange risk and is not a standard ETH-pegged asset for this basket.",
            "timestamp": "2026-01-29T00:27:02.968Z"
        },
        {
            "address": "0xc6a9851def913016074ac089e194f65945343462",
            "reason": "MRETH (Moldavian Ruble Wrapped Ethereum) is a suspicious token with extremely low TVL and no association with legitimate Ethereum liquid staking or wrapping protocols.",
            "timestamp": "2026-01-29T00:32:09.026Z"
        },
        {
            "address": "0xc700e80556fa35ea368c07f8298c41aca3211e9f",
            "reason": "ETHR (Ethereum Recovery) is not a recognized ETH-pegged asset and is frequently associated with fraudulent 'scam recovery' schemes.",
            "timestamp": "2026-01-29T00:32:09.028Z"
        },
        {
            "address": "0x292a477e521230fe230c13c93374adde8ddec1c1",
            "reason": "RUETH (Russian Ruble Wrapped Ethereum) lacks a legitimate protocol backing and appears to be a niche or suspicious token not suitable for this basket.",
            "timestamp": "2026-01-29T00:32:09.028Z"
        }
    ],
    "btc-pegged-assets": [
        {
            "address": "0x476908d9f75687684ce3dbf6990e722129cdbcc6",
            "reason": "This address is an impersonator of the official Wrapped Bitcoin (WBTC) token, which has the contract address 0x2260fac5e5542a773aa44fbcfedf7c193bc2c599 on Ethereum.",
            "timestamp": "2026-01-29T00:58:38.034Z"
        },
        {
            "address": "0x199cc8f0ac008bdc8cf0b1ccd5187f84e168c4d2",
            "reason": "The token shows suspicious volume-to-TVL ratios and does not match the official addresses for known zkBTC projects, suggesting it is a low-liquidity impersonator.",
            "timestamp": "2026-01-29T00:58:38.035Z"
        },
        {
            "address": "0x55dbb3a6f734dcee3e900be8708323a14e25e14b",
            "reason": "This is a malicious impersonator of WBTC. The legitimate WBTC contract on Ethereum is 0x2260fac5e5542a773aa44fbcfedf7c193bc2c599; this address has negligible TVL and failed honeypot security checks.",
            "timestamp": "2026-01-29T01:01:02.375Z"
        }
    ]
}